app/controllers/images_controller.rb

  def create
    @image = Image.new(image_params)
    @image.user = current_user

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("name", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["picture", "Bahubali-2-The-Conclusion-4.gif"], ["user_id", 7], ["created_at", "2017-04-17 01:07:01.984988"], ["updated_at", "2017-04-17 01:07:01.984988"]]